    # 1.  Створити список цілих чисел, 
    #   які вводяться з терміналу та 
    #   визначити серед них максимальне та мінімальне число.

# q = int(input("Введіть кількість елементів списку:"))
# a = [int(input("Введіть елемент списку (ціле число):")) for nevajno in range(q)]
# print("Ви створили список з", q, 'елементів, який має вигляд:', a)
# print("Максимальне з-ння має елемент", max(a))
# print("Мінімальне з-ння має елемент", min(a))



    #2.  В інтервалі від 1 до 10 визначити числа 
    #   •  парні, які діляться на 2,
    #   •  непарні, які діляться на 3, 
    #   •  числа, які не діляться на 2 та 3.

# for x in range(1, 11):
#     if x % 2==0:
#         print([x], ' - парне')
    
#     elif x % 3 ==0:
#         print([x], ' - непарне')

#     else:
#         print([x], ' - просте')



    # 3.  Написати програму, яка обчислює факторіал числа, яке користувач вводить.
    #  (не використовувати рекурсивного виклику функції)

# f = int(input('введіть число, факторіал якого необхідно визначити:'))
# k = 1
# for i in range(2, f+1):
#     k = k*i
# print(f,'!=',k)


    # 4.  Напишіть скрипт, який перевіряє логін, який вводить користувач. 
    # Якщо логін вірний (First), то привітайте користувача. 
    # Якщо ні, то виведіть повідомлення про помилку. 
    # (використайте цикл while)

# log = str(input('Введіть логін:'))
# logKey = 'First'
# while log == logKey:
#     print("Звідки Ви знаєте вірний логін?")  #знаю, що зациклюється)
# else:
#     print("Логін невірний, спробуйте ще раз")


    # 5.  Перший випадок. 
    # Написати програму, яка буде зчитувати числа поки не зустріне від’ємне число. 
    # При появі від’ємного числа програма зупиняється 
    # (якщо зустрічається 0 програма теж зупиняється).

# ch = int(input('Введіть число >0:'))
# while ch > 0:
#     if ch > 0:
#       ch = int(input('Введіть число >0:'))
# else:
#     print('Ви ввели число <=0')


    # 6.  Другий випадок. 
    # На початку на вхід подається кількість елементів послідовності,
    # а потім самі елементи. При появі від’ємного числа програма зупиняється
    # (якщо зустрічається 0 програма теж зупиняється).

# cn = int(input("Введіть кількість елементів послідовності:"))
# ch2 = [int(input("Введіть елемент послідовності (додатнє ціле число):")) for nevajno in range(cn)]
# print("Ви створили список з", cn, 'елементів, який має вигляд:', ch2)

# for j in ch2:
#     while j<=0:
#         if j<=0:
#             print('Погані новини для Вас')
#             break
#         else:
#             print('Ви справились з підбором додатніх чисел')


    # 7.  Знайти прості числа від 10 до 30,
    # а всі решта чисел представити у вигляді добутку чисел.

# for bas in range(10,31):
#     if bas % 2!=0 and bas % 3 !=0:
#         print([bas], ' - просте')
#     elif bas % 2 == 0:
#         d=int(bas/2)
#         print([bas],' - це як 2 *',d)
   