    #1.  Написати функцію, яка знаходить середнє арифметичне 
    #    значення довільної кількості чисел. 


# def aref(*args):
#     return sum(args)/len(args)
# print(aref(50, 60, 70))


    #2.  Написати функцію, яка повертає абсолютне значення числа

# def absul(a):
#     if a>=0:
#         print(a)
#     else:
#         print(-a)
# print(absul(-5))

    #3.  Написати функцію, яка знаходить максимальне число з двох чисел, 
    #    а також в функції використати рядки документації DocStrings.

# def maxi(a,b):
#     """Max """   
#     print(max(a,b))
# print(maxi(4,8))

    #4.  Написати програму, яка обчислює площу прямокутника, трикутника та кола 
    #    (написати три функції для обчислення площі, 
    #    і викликати їх в головній програмі в залежності від вибору користувача)

# def pr():
#     a = float(input('Введіть довжину однієї сторони:'))
#     b = float(input('Введіть довжину другої сторони:'))
#     print('площа прямокутника:', a*b, 'периметр:', a*2+b*2)

# def tr():
#     t1 = float(input('Введіть довжину однієї сторони:'))
#     h1 = float(input('Висоту, опущену на третю сторону:'))
#     print("Площа трикутника:", 0.5*t1*h1)

# def kr():
#     r = float(input('Введи радіус круга:'))
#     print('Площа круга:', 3.14*(r**2))


# print('Введіть: Площа прямокутника - 1/Площа круга - 2/Площа трикутника - 3')
# n = input()

# if n == "1":
#     pr()
# elif n == "2":
#     tr()
# elif n == "3":
#     kr()
# else:
#     print("не розумію(")

    #5.  Написати функцію, яка обчислює суму цифр введеного числа.

# def suma(chuslo):
#     print('Cума цифр числа:', sum(map(int, list(chuslo))))

# g = input('Введіть число:')
# suma(g)


    # 6.  Написати програму калькулятор, яка складається з наступних функцій: 
    # головної, яка пропонує вибрати дію та додаткових, які реалізовують вибрані дії,
    # калькулятор працює доти, поки ми не виберемо дію вийти з калькулятора, 
    # після виходу, користувач отримує повідомлення з подякою за вибір нашого програмного продукту!!!

# def dod():
#     a = float(input('Введіть перше число:'))
#     b = float(input('Введіть друге число:'))
#     print('Сума чисел:', a+b)
#     v = input("Для продовження додавання - 1/ для виходу в головне меню -2:")
#     while v =="1" or "2":
#         if v == "1":
#             return dod()
#         else:
#             return golovna()

# def vid():
#     a = float(input('Введіть перше число:'))
#     b = float(input('Висоту, друге число:'))
#     print("Різниця чисел:", a-b)
#     v = input("Для продовження віднімання - 1/ для виходу в головне меню -2:")
#     while v =="1" or "2":
#         if v == "1":
#             return vid()
#         else:
#             return golovna()

# def golovna():
#     print('Введіть: Додавання - 1/Віднімання - 2/Вихід - 3:')
#     n = input()
#     while n == "1" or "2" or "3":
#         if n == "1":
#             dod()
#         elif n == "2":
#             vid()
#         elif n == "3":
#             print("Дякую за користування!")
#             exit()
#         else:
#             print("?")
#             break
# golovna()


    # 7.  Побудувати рекурсивну функцію обчислення чисел Фібоначі до числа
    # введеного користувачем.

    
# def my_fibonacci(n):
#     if n in (1,2):
#         return 1
#     return my_fibonacci(n-1) + my_fibonacci(n-2)
# a = int(input('Введіть число:'))
# print(my_fibonacci(a))


 #8.  Написати програму, яка обчислює дискримінант квадратного рівняння

# def dys():
#     a = float(input("Введіть а:"))
#     b = float(input("Введіть b:"))
#     c = float(input("Введіть c:"))
#     print("D=", b**2-4*a*c)