    #4.  Створити список, який містить елементи цілочисельного типу, потім за допомогою циклу перебору змінити тип даних елементів на числа з плаваючою крапкою. 
    #    (Підказка: використати вбудовану функцію float ()).
# a = [4, 1, 2, 6, 2]
# for j in a:
#     print(float(j))

    # 5.  Вивести числа Фібоначі включно до введеного числа n, 
    #     використовуючи цикли. 
    #     (Послідовність чисел Фібоначі 0, 1, 1, 2, 3, 5, 8, 13 і т.д.)

# fib1 = 0
# fib2 = 1
 
# n = int(input())
# print("0 1", end=' ')
# for i in range(2, n+1):
#     fib1, fib2 = fib2, fib1+fib2
#     if fib2 <= n+1:
#         print(fib2, end=' ')

    #6.  Створити список, що складається з чотирьох елементів типу string. 
    #    Потім, за допомогою циклу for, вивести елементи по черзі на екран.

# spisok = ["gs", "34", "trbe", "gfbd"]
# for j in spisok:
#     print(j)