    #1.  Написати скрипт, який з двох введених 
    #    чисел визначить, яке з них більше, а яке менше

# a = int(input("a="))
# b = int(input("b="))

# if a > b:
#    print("a>b")
# else:
#     print("a<b")

    #2.  Написати скрипт, який перевірить чи введене число парне
    #    чи непарне і вивести відповідне повідомлення.

# d = int(input("a="))

# if d % 2==0:
#     print("Число парне")
# else:
#     print("Число непарне")

    #3.a)  Написати скрипт, який обчислить факторіал введеного числа.

# n = int(input("a="))
 
# factorial = 1
# while n > 1:
#     factorial *= n
#     n -= 1
 
# print(factorial)

# n = int(input())
 
    #  #3.b) Написати скрипт, який обчислить факторіал введеного числа.

# factorial = 1
 
# for i in range(2, n+1):
#     factorial *= i
 
# print(factorial)